import json

data_for_mess = {
    "choice_of_area": """
    Добро пожаловать! Вас приветствует бот от Федерального Дорожного агенства. \
Прежде чем мы начнем, мне нужно узнать ваше нынешнее местоположение 
    """,
    "route_chelyabinsk": [
        "Челябинск-Москва",
        "Челябинск-Екатеринбург",
        "Челябинск-Троицк",
        "Челябинск-Курган"
    ],
    "route_kurgan": [
        "Курган-Москва",
        "Курган-Екатеринбург",
        "Курган-Троицк",
        "Курган-Челябинск"
    ],
    "route_choice": """
    Хорошо! Теперь подскажите пожалуйста по какой трассе Вы собираетесь ехать?
    """,
    "choose_action": """
    Отлично! Вы хотели бы о чём-то сообщить или что-то узнать?
    """,
    "choose_report": [
        "Дорожно-транспортное происшествие",
        "Недостатки содержания дороги",
        "Противоправные действия 3-их лиц",
        "Угроза жизни и здоровью",
    ],
    "text_report": """
    Хорошо! О чем именно Вы хотите сообщить
    """,
    "traffic_accident": """
    Понял. Вам нужно обратиться в ГИБДД. Вот список номеров:
Челябинская область:
    +7(351)251-03-21
    +7(351)256-16-84
    +7(351)256-28-08
Курганская область:
    +7(3522)25-64-90
    """,
    "road_deficiencies": """
    Принял. Тогда Вам нужно выбрать тип недостатка содержания \
дороги, по возможности сфотографировать его и отправить геолокаци.
    """,
    "type_road_deficiencies": [
        "Тип1",
        "Тип2",
        "Тип3",
        "Тип4"
    ],
    "text_for_type_road_deficiencies": """
    Пожалуйста выберите тип недостаток содержания из предложенных:
    """,
    "photo_road_deficiencies": """
    Теперь пожалуйста отправьте фотографию недостатка содержания дороги:
    """,
    "locate_road_deficiencies": """
    Осталось отправить геолокацию недостатка дороги:
    """,
}

with open('data_for_mess.json', 'w') as file:
    json.dump(data_for_mess, file)
