import json

data_for_mess = {
    "choice_of_area": """
    Добро пожаловать! Вас приветствует бот от Федерального Дорожного агенства. \
Прежде чем мы начнем, мне нужно узнать ваше нынешнее местоположение 
    """,
    "route_chelyabinsk": [
        "Челябинск-Москва",
        "Челябинск-Екатеринбург",
        "Челябинск-Троицк",
        "Челябинск-Курган"
    ],
    "route_kurgan": [
        "Курган-Москва",
        "Курган-Екатеринбург",
        "Курган-Троицк",
        "Курган-Челябинск"
    ],
    "route_choice": """
    Хорошо! Теперь подскажите пожалуйста по какой трассе вы собираетесь ехать?
    """,
    "choose_action": """
    Отлично! Вы хотели бы о чём-то сообщить или что-то узнать?
    """
}

with open('data_for_mess.json', 'w') as file:
    json.dump(data_for_mess, file)
